@pragma('vm:entry-point')
List<Map<String, dynamic>> otherDuaData = [
  {
    'title': 'মোনাজাতের যিকিরসমূহ',
    'arabic':
        'لَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِير ٌ۝\nسُبْحَانَ اللّٰهِ\nالْحَمْدُ لِلّٰهِ\nلَا إِلٰهَ إِلَّا اللّٰهُ\nلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ\nاللّٰهُمَّ اغْفِرْ لِي',
    'bangla_ucharon':
        'লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু লাহুল মুলকু ওয়া লাহুল হামদু ওয়া হুয়া আলা কুল্লি শাইয়িন কাদির\nসুবহানাল্লাহ\nআলহামদুলিল্লাহ\nলা ইলাহা ইল্লাল্লাহ\nলা হাওলা ওয়া লা কুওয়াতা ইল্লা বিল্লাহ\nআল্লাহুম্মাগফিরলি',
    'bangla_ortho':
        'আল্লাহ ছাড়া কোনো সত্য উপাস্য নেই তিনি একক তাঁর কোনো অংশীদার নেই সার্বভৌম কর্তৃত্ব তাঁরই এবং সমস্ত প্রশংসাও তাঁরই জন্য আর তিনি সব কিছুর উপর সর্বশক্তিমান\nআল্লাহ পবিত্র\nসমস্ত প্রশংসা আল্লাহর জন্য\nআল্লাহ ছাড়া কোনো সত্য উপাস্য নেই\nআল্লাহর সাহায্য ছাড়া কোনো শক্তি ও ক্ষমতা নেই\nহে আল্লাহ আমাকে ক্ষমা করুন',
    'repeat': 'মোনাজাতের সময় ইচ্ছামতো',
    'fojilot':
        'এই যিকিরগুলো দিয়ে মোনাজাত করলে আল্লাহর স্মরণ পরিপূর্ণ হয় দোয়া কবুলের আশা বৃদ্ধি পায় এবং গুনাহ মাফের বিশেষ সুযোগ সৃষ্টি হয়',
  },
  {
    'title': 'দোয়াসমূহ',
    'arabic':
        'اللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ\nوَأَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ\nوَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ\nوَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ',
    'bangla_ucharon':
        'আল্লাহুম্মা ইন্নি আউজুবিকা মিন আজাবিল কবর\nওয়া আউজুবিকা মিন আজাবি জাহান্নাম\nওয়া আউজুবিকা মিন ফিতনাতিল মাহইয়া ওয়াল মামাত\nওয়া আউজুবিকা মিন ফিতনাতিল মাসিহিদ দাজ্জাল',
    'bangla_ortho':
        'হে আল্লাহ আপনি আমাকে কবরের আযাব থেকে রক্ষা করুন\nএবং আমাকে জাহান্নামের আযাব থেকে রক্ষা করুন\nএবং আমাকে জীবন ও মৃত্যুর ফিতনা থেকে রক্ষা করুন\nএবং আমাকে মসীহ দাজ্জালের ফিতনা থেকে রক্ষা করুন',
    'repeat':
        "নবীজী বলেছেন, আত্তাহিয়াতু, তাশাহুদ পড়ার পরে এই গুলো থেকে পানাহ না চেয়ে  নামাজের সালাম না ফেরাতে।",
    'fojilot':
        'এই দোয়াগুলো পড়লে কবর জাহান্নাম জীবন মরণ ও দাজ্জালের ভয়াবহ ফিতনা থেকে আল্লাহর বিশেষ হেফাজত পাওয়া যায়',
  },
  {
    'title': 'ঋণ মুক্তির দোয়া',
    'arabic':
        'اللّٰهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ',
    'bangla_ucharon':
        'আল্লাহুম্মা ইকফিনি বিহালালিকা আন হারামিকা ওয়া আগনিনি বিফাদলিকা আম্মান সিওয়াক',
    'bangla_ortho':
        'হহে আল্লাহ! তোমার হালালের মাধ্যমে আমাকে তোমার হারাম থেকে দূরে রাখ এবং তোমার দয়ায় তুমি ছাড়া অন্য কারো মুখাপেক্ষী হওয়া থেকেও আমাকে আত্মনির্ভরশীল (ঋণমুক্ত) করো।',
    'repeat': '১ বার',
    'fojilot':
        'এই দোয়া নিয়মিত পাঠ করলে আল্লাহর ইচ্ছায় ঋণ পরিশোধের সহজ রাস্তা সৃষ্টি হয় এবং হালাল রিজিক বৃদ্ধি পায়',
  },
  {
    'title': 'দোয়া (دعاء)',
    'arabic': 'سُبْحَانَ اللّٰهِ وَبِحَمْدِهِ سُبْحَانَ اللّٰهِ الْعَظِيمِ',
    'bangla_ucharon': 'সুবহানাল্লাহি ওয়া বিহামদিহি সুবহানাল্লাহিল আজীম',
    'bangla_ortho':
        'আমি আল্লাহর পবিত্রতা ও প্রশংসা ঘোষণা করছি তিনি মহামহিমান্বিত',
    'repeat': 'ফজর ও মাগরিবে ১০০ বার এবং অন্যান্য সময়ে ইচ্ছামতো',
    'fojilot':
        'এই যিকির পাঠ করলে আল্লাহর নিকট অতি প্রিয় আমল হিসেবে গণ্য হয় গুনাহ মাফ হয় এবং সাওয়াবের পাল্লা ভারী হয়',
    'tasbih': 100,
  },
  {
    'title': 'আল্লাহর নিকট সর্বাধিক প্রিয় চার বাক্য',
    'arabic':
        'سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلا اللَّهُ ، وَاللَّهُ أَكْبَرُ',
    'bangla_ucharon':
        'সুবহানাল্লাহি; আলহামদুলিল্লাহি; লা ইলাহা ইল্লাল্লাহু; আল্লাহু আকবার।',
    'bangla_ortho':
        'আল্লাহ পবিত্র; আল্লাহর জন্য প্রশংসা; আল্লাহ ছাড়া কোনো মাবুদ নেই এবং আল্লাহ সর্বাপেক্ষা মহান।',
    'repeat': 'পাঁচ ওয়াক্ত নামাজের পর ৩৩ বার করে এবং ঘুমানোর আগে ৩৩ বার করে',
    'fojilot':
        'এই চারটি বাক্য আল্লাহর নিকট সবচেয়ে প্রিয় যিকিরসমূহ এর আমলে গুনাহ মাফ হয় এবং এর সওয়াব আরশের চারপাশে মৌমাছির গুঞ্জনের মতো ঘুরতে থাকে',
    'tasbih': 33,
  },
  {
    'title': 'শ্রেষ্ঠ জিকির',
    'arabic':
        'اللّٰهُمَّ صَلِّ عَلَىٰ مُحَمَّدٍ\nأَسْتَغْفِرُ اللّٰهَ\nأَسْتَغْفِرُ اللّٰهَ الَّذِي لَا إِلٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ وَأَتُوبُ إِلَيْهِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ\nيَا ذَا الْجَلَالِ وَالْإِكْرَامِ\nلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ\nلَا إِلٰهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ\nسُبْحَانَ اللّٰهِ\nالْحَمْدُ لِلّٰهِ\nلَا إِلٰهَ إِلَّا اللّٰهُ\nاللّٰهُ أَكْبَرُ',
    'bangla_ucharon':
        'আল্লাহুম্মা সাল্লি আলা মুহাম্মদ\nআস্তাগফিরুল্লাহ\nআস্তাগফিরুল্লাহাল্লাজি লা ইলাহা ইল্লা হুওয়াল হাইয়্যুল কাইয়্যুমু ওয়া আতুবু ইলাইহি লা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহ\nইয়া জাল জালালি ওয়াল ইকরাম\nলা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহ\nলা ইলাহা ইল্লা আনতা সুবহানাকা ইন্নি কুনতু মিনাজ জ্বালিমিন\nসুবহানাল্লাহ\nআলহামদুলিল্লাহ\nলা ইলাহা ইল্লাল্লাহ\nআল্লাহু আকবর',
    'bangla_ortho':
        'হে আল্লাহ মুহাম্মদের উপর রহমত বর্ষণ করুন\nআমি আল্লাহর নিকট ক্ষমা চাই\nআমি সেই আল্লাহর নিকট ক্ষমা চাই যিনি ছাড়া কোনো উপাস্য নেই তিনি চিরঞ্জীব ও সবকিছুর ধারক এবং আমি তাঁর কাছেই তওবা করছি আল্লাহ ছাড়া কোনো শক্তি ও ক্ষমতা নেই\nহে মহিমা ও সম্মানের অধিকারী\nআল্লাহ ছাড়া কোনো শক্তি ও ক্ষমতা নেই\nআপনি ছাড়া কোনো উপাস্য নেই আপনি পবিত্র নিশ্চয়ই আমি জালিমদের অন্তর্ভুক্ত ছিলাম\nআমি আল্লাহর পবিত্রতা ঘোষণা করছি\nসব প্রশংসা আল্লাহর জন্য\nআল্লাহ ছাড়া কোনো সত্য উপাস্য নেই\nআল্লাহ সর্বশ্রেষ্ঠ',
    'repeat': 'সারাদিন ইচ্ছামতো',
    'fojilot':
        'এই ছয়টি জিকির নিয়মিত আমল করলে আল্লাহর স্মরণ সদা জাগ্রত থাকে গুনাহ মাফ হয় অন্তরের প্রশান্তি আসে দুনিয়া ও আখিরাতের পেরেশানি দূর হয় এবং জান্নাতের গুপ্তধনসমূহ লাভের আশা করা যায়',
  },
];
