@pragma('vm:entry-point')
final List<Map<String, dynamic>> salatElements = [
  {
    "title": "সানা",
    "arabic":
        "سُبحانَكَ اللَّهمَّ وبحَمدِكَ، وتبارَك اسمُكَ، وتعالى جَدُّكَ، ولا إلهَ غيرُكَ",
    "bangla_ucharon":
        "সুবহানাকা আল্লাহুম্মা ওয়া বিহামদিকা, ওয়া তাবারাকাসমুকা ওয়া তাআলা জাদ্দুকা, ওয়া লা ইলাহা গাইরুকা।",
    "bangla_ortho":
        "হে আল্লাহ! আমি আপনারই পবিত্রতা ঘোষণা করছি এবং আপনারই প্রশংসা করছি। আপনার নাম বরকতময়, আপনার মহিমা অতি উচ্চ এবং আপনি ছাড়া আর কোনো উপাস্য নেই।",
  },
  {
    "title": "রুকুর তাসবিহ",
    "arabic": "سُبْحَانَ رَبِّىَ الْعَظِيْمِ",
    "bangla_ucharon": "সুবহানা রাব্বিয়াল আজীম।(কমপক্ষে ৩ বার)",
    "bangla_ortho": "আমার মহান রবের পবিত্রতা ঘোষণা করছি।",
  },
  {
    "title": "রুকু থেকে ওঠার সময়",
    "arabic": "سمع الله لمن حمده",
    "bangla_ucharon": "সামিয়াল্লাহু লিমান হামিদাহ।",
    "bangla_ortho": "যে আল্লাহর প্রশংসা করে, আল্লাহ তা শোনেন।",
  },
  {
    "title": "সোজা হয়ে দাঁড়িয়ে",
    "arabic": "رَبَّنَا لَكَ الْحَمْدُِ",
    "bangla_ucharon": "রব্বানা লাকাল হামদ।",
    "bangla_ortho": "হে আমাদের রব! সমস্ত প্রশংসা আপনারই।",
  },
  {
    "title": "সিজদার তাসবিহ",
    "arabic": "ِسُبْحَانَ رَبِّىَ الْاَعْلٰى",
    "bangla_ucharon": "সুবহানা রাব্বিয়াল আলা।(কমপক্ষে ৩ বার)",
    "bangla_ortho": "আমার মহান উচ্চমর্যাদাশীল রবের পবিত্রতা ঘোষণা করছি",
  },
  {
    "title": "দুই সিজদার মাঝখানে বসে",
    "arabic": "اَللّٰهُمَّ اغْفِرْلِىْ وَارْحَمْنِىِْ",
    "bangla_ucharon": "আল্লাহুম্মাগফিরলী ওয়ারহামনী।",
    "bangla_ortho": "হে আল্লাহ! আমাকে ক্ষমা করুন এবং আমার ওপর রহম করুন।",
  },
  {
    "title": "আত্তাহিয়াতু",
    "arabic":
        "التَّحِيَّاتُ لِلّٰهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللّٰهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَىٰ عِبَادِ اللّٰهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلٰهَ إِلَّا اللّٰهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
    "bangla_ucharon":
        "আত্তাহিয়্যাতু লিল্লাহি ওয়াস্ সালাওয়াতু ওয়াত্ তাইয়্যিবাতু আস্ সালামু আলাইকা আইয়্যুহান্ নবিইয়্যু ওয়া রহমাতুল্লাহি ওয়া বারাকাতুহু আস্ সালামু আলাইনা ওয়া আলা ইবাদিল্লাহিস সালিহীন আশহাদু আল্লা ইলাহা ইল্লাল্লাহু ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রাসুলুহু",
    "bangla_ortho":
        "সব মৌখিক, দৈহিক ও আর্থিক ইবাদত আল্লাহর জন্য। হে নবী! আপনার প্রতি শান্তি, আল্লাহর রহমত ও বরকত বর্ষিত হোক। আমাদের ও আল্লাহর নেক বান্দাদের ওপর শান্তি বর্ষিত হোক। আমি সাক্ষ্য দিচ্ছি, আল্লাহ ছাড়া কোনো উপাস্য নেই এবং মুহাম্মদ ﷺ তাঁর বান্দা ও রাসূল",
  },

  {
    "title": "দরুদ শরীফ(দুরুদে ইব্রাহিম)",
    'arabic':
        'اللّٰهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ اللّٰهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ',
    'bangla_ucharon':
        'আল্লাহুম্মা সাল্লি আলা মুহাম্মাদিও ওয়া আলা আলি মুহাম্মাদ কামা সাল্লাইতা আলা ইবরাহিমা ওয়া আলা আলি ইবরাহিমা ইন্নাকা হামিদুম মাজিদ আল্লাহুম্মা বারিক আলা মুহাম্মাদিও ওয়া আলা আলি মুহাম্মাদ কামা বারাকতা আলা ইবরাহিমা ওয়া আলা আলি ইবরাহিমা ইন্নাকা হামিদুম মাজিদ',
    'bangla_ortho':
        'হে আল্লাহ আপনি মুহাম্মাদ ﷺ ও তাঁর বংশধরের উপর রহমত বর্ষণ করুন যেমন আপনি ইবরাহিম ও তাঁর বংশধরের উপর রহমত বর্ষণ করেছেন নিশ্চয়ই আপনি প্রশংসিত ও মহিমান্বিত হে আল্লাহ আপনি মুহাম্মাদ ﷺ ও তাঁর বংশধরের উপর বরকত দান করুন যেমন আপনি ইবরাহিম ও তাঁর বংশধরের উপর বরকত দান করেছেন নিশ্চয়ই আপনি প্রশংসিত ও মহিমান্বিত',
  },

  {
    "title": "দোয়া মাসুরা",
    "arabic":
        "اَللّٰهُمَّ اِنِّىْ ظَلَمْتُ نَفْسِيْ ظُلْمًا كَثِيْرًا وَّ لَا يَغْفِرُ الذُّنُوْبَ اِلَّا اَنْتَ فَاغْفِرْ لِيْ مَغْفِرَةً مِّنْ عِنْدِكَ وَارْحَمْنِيْ اِنَّكَ اَنْتَ الْغَفُوْرُ الرَّحِيْمُِ",
    "bangla_ucharon":
        "আল্লাহুম্মা ইন্নি জালামতু নাফসি জুলমান কাসিরাও ওয়ালা ইয়াগফিরুজ জুনুবা ইল্লা আনতা, ফাগফিরলি মাগফিরাতাম মিন ইনদিকা ওয়ারহামনি, ইন্নাকা আনতাল গাফুরুর রাহিম।",
    "bangla_ortho":
        "হে আল্লাহ! আমি আমার নিজের ওপর অনেক জুলুম করেছি। আপনি ছাড়া আর কেউ গুনাহ ক্ষমা করতে পারে না। অতএব আপনি নিজ অনুগ্রহে আমাকে ক্ষমা করুন এবং আমার ওপর রহম করুন। নিশ্চয়ই আপনি পরম ক্ষমাশীল ও অসীম দয়ালু।",
  },

  {
    "title": "দোয়া কুনুত",
    "arabic":
        "اَللّٰهُمَّ اِنَّا نَسْتَعِيْنُكَ وَنَسْتَغْفِرُكَ وَنُؤْمِنُ بِكَ وَنَتَوَكَّلُ عَلَيْكَ وَنُثْنِىْ عَلَيْكَ الْخَيْرَ وَنَشْكُرُكَ وَلَا نَكْفُرُكَ وَنَخْلَعُ وَنَتْرُكُ مَنْ يَّفْجُرُكَ - اَللّٰهُمَّ اِيَّاكَ نَعْبُدُ وَلَكَ نُصَلِّىْ وَنَسْجُدُ وَاِلَيْكَ نَسْعٰى وَنَحْفِدُ وَنَرْجُوْ رَحْمَتَكَ وَنَخْشٰى عَذَابَكَ اِنَّ عَذَابَكَ بِالْكُفَّارِ مُلحِقٌَ",
    "bangla_ucharon":
        "আল্লাহুম্মা ইন্না নাস্তায়িনুকা ওয়া নাস্তাগফিরুকা, ওয়া নু'মিনু বিকা ওয়া নাতাওয়াককালু আলাইকা, ওয়া নুছনি আলাইকাল খাইরা ওয়া নাশকুরুকা, ওয়া লা নাকফুরুকা ওয়া নাখলাউ ওয়া নাতরুকু মাই ইয়াফজুরুকা। আল্লাহুম্মা ইয়্যাকা নাবুদু ওয়া লাকা নুসাল্লি ওয়া নাসজুদু, ওয়া ইলাইকা নাস'আ ওয়া নাহফিদু, ওয়া নারজু রাহমাতাকা ওয়া নাখশা আজাবাকা, ইন্না আজাবাকা বিল কুফফারি মুলহিক্ব।",
    "bangla_ortho":
        "হে আল্লাহ! আমরা আপনারই সাহায্য চাই এবং আপনারই কাছে ক্ষমা প্রার্থনা করছি। আপনার ওপর ঈমান আনছি ও আপনার ওপরই ভরসা করছি। আপনার উত্তম প্রশংসা করছি, আপনার শুকরিয়া আদায় করছি এবং আপনার প্রতি অকৃতজ্ঞ হচ্ছি না। যারা আপনার নাফরমানি করে, তাদের সঙ্গে আমরা সম্পর্ক ছিন্ন করি ও তাদের বর্জন করি। হে আল্লাহ! আমরা আপনারই ইবাদত করি, আপনারই জন্য নামাজ পড়ি ও সিজদা করি। আপনারই দিকে ধাবিত হই এবং আপনার হুকুম পালনের জন্য প্রস্তুত থাকি। আপনার রহমতের আশা করি ও আপনার আজাবকে ভয় পাই। নিশ্চয়ই আপনার আজাব কাফেরদের জন্য অবধারিত।",
  },
];
