@pragma('vm:entry-point')
final List<Map<String, dynamic>> salatDataList = [
  {
    "salat_name": "ফজর",
    "items": [
      {
        "type": "সুন্নত",
        "title": "২ রাকাত সুন্নত",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى رَكْعَتَىْ صَلٰوةِ الْفَجْرِ سُنَّةُ رَسُوْلِ اللّٰهِ تَعَالَى مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা রাকআতাই সালাতিল ফাজরি সুন্নাতু রাসূলিল্লা‌হি তাআলা মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho":
            "আমি আল্লাহর সন্তুষ্টির জন্য কেবলামুখী হয়ে ফজরের দুই রাকাত সুন্নত নামাজের নিয়ত করছি, আল্লাহু আকবার।",
      },
      {
        "type": "ফরজ",
        "title": "২ রাকাত ফরজ",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى رَكْعَتَىْ صَلٰوةِ الْفَجْرِ فَرْضُ اللّٰهِ تَعَالَى مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা রাকআতাই সালাতিল ফাজরি ফারদুল্লা‌হি তাআলা মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho":
            "আমি আল্লাহর সন্তুষ্টির জন্য কেবলামুখী হয়ে ফজরের দুই রাকাত ফরজ নামাজের নিয়ত করছি, আল্লাহু আকবার।",
      },
    ],
  },

  {
    "salat_name": "যোহর",
    "items": [
      {
        "type": "সুন্নত",
        "title": "৪ রাকাত সুন্নত",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى اَرْبَعَ رَكَعَاتِ صَلٰوةِ الظُّهْرِ سُنَّةُ رَسُوْلِ اللّٰهِ تَعَالَى مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা আরবাআ রাকাআতি সালাতিজ জুহরি সুন্নাতু রাসূলিল্লা‌হি তাআলা মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho":
            "আমি আল্লাহর সন্তুষ্টির জন্য যোহরের চার রাকাত সুন্নত নামাজের নিয়ত করছি।",
      },
      {
        "type": "ফরজ",
        "title": "৪ রাকাত ফরজ",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى اَرْبَعَ رَكَعَاتِ صَلٰوةِ الظُّهْرِ فَرْضُ اللّٰهِ تَعَالَى مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা আরবাআ রাকাআতি সালাতিজ জুহরি ফারদুল্লা‌হি তাআলা মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho": "আমি যোহরের চার রাকাত ফরজ নামাজের নিয়ত করছি।",
      },
      {
        "type": "সুন্নত",
        "title": "২ রাকাত সুন্নত",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى رَكْعَتَىْ صَلٰوةِ الظُّهْرِ سُنَّةُ رَسُوْلِ اللّٰهِ تَعَالَى مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা রাকআতাই সালাতিজ জুহরি সুন্নাতু রাসূলিল্লা‌হি তাআলা মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho":
            "আমি আল্লাহর সন্তুষ্টির জন্য কেবলামুখী হয়ে যোহরের দুই রাকাত সুন্নত নামাজের নিয়ত করছি, আল্লাহু আকবার।",
      },
    ],
  },

  {
    "salat_name": "আসর",
    "items": [
      {
        "type": "সুন্নত",
        "title": "৪ রাকাত সুন্নত",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى اَرْبَعَ رَكَعَاتِ صَلٰوةِ الْعَصْرِ سُنَّةُ رَسُوْلِ اللّٰهِ تَعَالَى مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা আরবাআ রাকাআতি সালাতিল আসরি সুন্নাতু রাসূলিল্লা‌হি তাআলা মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho":
            "আমি আল্লাহর সন্তুষ্টির জন্য কেবলামুখী হয়ে আসরের চার রাকাত সুন্নত নামাজের নিয়ত করছি, আল্লাহু আকবার।",
      },
      {
        "type": "ফরজ",
        "title": "৪ রাকাত ফরজ",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى اَرْبَعَ رَكَعَاتِ صَلٰوةِ الْعَصْرِ فَرْضُ اللّٰهِ تَعَالَى مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা আরবাআ রাকাআতি সালাতিল আসরি ফারদুল্লা‌হি তাআলা মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho": "আমি আসরের চার রাকাত ফরজ নামাজের নিয়ত করছি।",
      },
    ],
  },

  {
    "salat_name": "মাগরিব",
    "items": [
      {
        "type": "ফরজ",
        "title": "৩ রাকাত ফরজ",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى ثَلَاثَ رَكَعَاتِ صَلٰوةِ الْمَغْرِبِ فَرْضُ اللّٰهِ تَعَالَى مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা সালাসা রাকাআতি সালাতিল মাগরিব ফারদুল্লা‌হি তাআলা মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho": "আমি মাগরিবের তিন রাকাত ফরজ নামাজের নিয়ত করছি।",
      },
      {
        "type": "সুন্নত",
        "title": "২ রাকাত সুন্নত",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى رَكْعَتَىْ صَلٰوةِ الْمَغْرِبِ سُنَّةُ رَسُوْلِ اللّٰهِ تَعَالَى مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা রাকআতাই সালাতিল মাগরিব সুন্নাতু রাসূলিল্লা‌হি তাআলা মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho":
            "আমি আল্লাহর সন্তুষ্টির জন্য কেবলামুখী হয়ে মাগরিবের দুই রাকাত সুন্নত নামাজের নিয়ত করছি, আল্লাহু আকবার।",
      },
      {
        "type": "নফল",
        "title": "২ রাকাত নফল",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى رَكْعَتَىْ صَلٰوةِ النَّفْلِ مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা রাকআতাই সালাতিন নাফলি মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho":
            "আমি আল্লাহর সন্তুষ্টির জন্য কেবলামুখী হয়ে দুই রাকাত নফল নামাজের নিয়ত করছি, আল্লাহু আকবার।",
      },
    ],
  },

  {
    "salat_name": "এশা",
    "items": [
      {
        "type": "ফরজ",
        "title": "৪ রাকাত ফরজ",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى اَرْبَعَ رَكَعَاتِ صَلٰوةِ الْعِشَاءِ فَرْضُ اللّٰهِ تَعَالَى مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা আরবাআ রাকাআতি সালাতিল ইশায়ি ফারদুল্লা‌হি তাআলা মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho": "আমি এশার চার রাকাত ফরজ নামাজের নিয়ত করছি।",
      },
      {
        "type": "সুন্নত",
        "title": "২ রাকাত সুন্নত",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى رَكْعَتَىْ صَلٰوةِ الْعِشَاءِ سُنَّةُ رَسُوْلِ اللّٰهِ تَعَالَى مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُُُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা রাকআতাই সালাতিল ইশায়ি সুন্নাতু রাসূলিল্লা‌হি তাআলা মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho":
            "আমি আল্লাহর সন্তুষ্টির জন্য কেবলামুখী হয়ে এশার দুই রাকাত সুন্নত নামাজের নিয়ত করছি, আল্লাহু আকবার।",
      },
      {
        "type": "ওয়াজিব",
        "title": "৩ রাকাত বিতর",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى ثَلَاثَ رَكَعَاتِ صَلٰوةِ الْوِتْرِ وَاجِبُ اللّٰهِ تَعَالَى مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা সালাসা রাকাআতি সালাতিল বিতরি ওয়াজিবুল্লাহি তাআলা মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho":
            "আমি আল্লাহর সন্তুষ্টির জন্য তিন রাকাত বিতর ওয়াজিব নামাজের নিয়ত করছি।",
      },
    ],
  },

  {
    "salat_name": "জুম্মা",
    "items": [
      {
        "type": "ফরজ",
        "title": "৪ রাকাত সুন্নত(জুম্মার ফরজের আগে)",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى اَرْبَعَ رَكَعَاتِ صَلٰوةِ قَبْلَ الْجُمُعَةِ سُنَّةُ رَسُوْلِ اللّٰهِ تَعَالَى مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা আরবাআ রাকাআতি সালাতিল কাবলাল জুমুআতি সুন্নাতু রাসূলিল্লা‌হি তাআলা মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho":
            "আমি আল্লাহর সন্তুষ্টির জন্য কেবলামুখী হয়ে জুম্মার ফরজের আগে ৪ রাকাত কাবলাল জুমআ সুন্নত নামাজের নিয়ত করছি, আল্লাহু আকবার।",
      },
      {
        "type": "ফরজ",
        "title": "২ রাকাত ফরজ",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى رَكْعَتَىْ صَلٰوةِ الْجُمُعَةِ فَرْضُ اللّٰهِ تَعَالَى اِقْتَدَيْتُ بِهٰذَا الْاِمَامِ مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা রাকআতাই সালাতিল জুমুআতি ফারদুল্লা‌হি তাআলা ইকতাদাইতু বিহালাল ইমামি মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho":
            "আমি আল্লাহর সন্তুষ্টির জন্য জুম্মার দুই রাকাত ফরজ নামাজ এই ইমামের পেছনে পড়ার নিয়ত করছি।",
      },
      {
        "type": "ফরজ",
        "title": "৪ রাকাত সুন্নত(জুম্মার ফরজের পরে)",
        "arabic":
            "نَوَيْتُ اَنْ اُصَلِّىَ لِلّٰهِ تَعَالَى اَرْبَعَ رَكَعَاتِ صَلٰوةِ بَعْدَ الْجُمُعَةِ سُنَّةُ رَسُوْلِ اللّٰهِ تَعَالَى مُتَوَجِّهًا اِلٰى جِهَةِ الْكَعْبَةِ الشَّرِيْفَةِ اَللّٰهُ اَكْبَرُ",
        "bangla_ucharon":
            "নাওয়াইতু আন উসাল্লিয়া লিল্লা‌হি তাআলা আরবাআ রাকাআতি সালাতিল বাদাল জুমুআতি সুন্নাতু রাসূলিল্লা‌হি তাআলা মুতাওয়াজজিহান ইলা জিহাতিল কাবাতিশ শারীফাতি আল্লাহু আকবার।",
        "bangla_ortho":
            "আমি আল্লাহর সন্তুষ্টির জন্য কেবলামুখী হয়ে জুম্মার ফরজের পরে ৪ রাকাত বাদাল জুমআ সুন্নত নামাজের নিয়ত করছি, আল্লাহু আকবার।",
      },
    ],
  },
];
