@pragma('vm:entry-point')
final List<Map<String, dynamic>> suraList = [
  {
    'sura_name': 'সূরা ফাতিহা (০১)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ ۝',
        'bangla_ucharon': 'বিসমিল্লাহির রাহমানির রাহিম।',
        'bangla_ortho': 'পরম করুণাময়, অতি দয়ালু আল্লাহর নামে (শুরু করছি)।',
      },
      {
        'no': 2,
        'arabic': 'الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ۝',
        'bangla_ucharon': 'আলহামদুলিল্লাহি রাব্বিল আলামীন।',
        'bangla_ortho': 'যাবতীয় প্রশংসা জগৎসমূহের প্রতিপালক আল্লাহরই জন্য।',
      },
      {
        'no': 3,
        'arabic': 'الرَّحْمَٰنِ الرَّحِيمِ ۝',
        'bangla_ucharon': 'আর-রাহমানির রাহীম।',
        'bangla_ortho': 'যিনি পরম করুণাময় ও অতি দয়ালু।',
      },
      {
        'no': 4,
        'arabic': 'مَالِكِ يَوْمِ الدِّينِ ۝',
        'bangla_ucharon': 'মালিকি ইয়াওমিদ্দীন।',
        'bangla_ortho': 'যিনি বিচার দিবসের মালিক।',
      },
      {
        'no': 5,
        'arabic': 'إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ ۝',
        'bangla_ucharon': 'ইয়্যাকা নাবুদু ওয়া ইয়্যাকা নাস্তায়ীন।',
        'bangla_ortho':
            'আমরা শুধু আপনারই ইবাদত করি এবং শুধু আপনারই সাহায্য চাই।',
      },
      {
        'no': 6,
        'arabic': 'اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ ۝',
        'bangla_ucharon': 'ইহদিনাস সিরাতাল মুস্তাকীম।',
        'bangla_ortho': 'আমাদেরকে সরল পথ প্রদর্শন করুন।',
      },
      {
        'no': 7,
        'arabic':
            'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ ۝',
        'bangla_ucharon':
            'সিরাতাল্লাজিনা আনআমতা আলাইহিম গাইরিল মাগদুবি আলাইহিম ওয়ালাদ দ্বাল্লীন।',
        'bangla_ortho':
            'তাদের পথ, যাদেরকে আপনি নেয়ামত দান করেছেন; তাদের পথ নয় যারা আপনার ক্রোধের শিকার এবং যারা পথভ্রষ্ট।',
      },
    ],
  },

  //---------------সূরা আর রহমান----------------------
  {
    'sura_name': 'সূরা আর রহমান (৫৫)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'الرَّحْمَٰنُ ۝',
        'bangla_ucharon': 'আর-রাহমান।',
        'bangla_ortho': 'পরম করুণাময়।',
      },
      {
        'no': 2,
        'arabic': 'عَلَّمَ الْقُرْآنَ ۝',
        'bangla_ucharon': 'আল্লামাল কুরআন।',
        'bangla_ortho': 'তিনি শিক্ষা দিয়েছেন কুরআন।',
      },
      {
        'no': 3,
        'arabic': 'خَلَقَ الْإِنْسَانَ ۝',
        'bangla_ucharon': 'খালাকাল ইনসান।',
        'bangla_ortho': 'তিনি সৃষ্টি করেছেন মানুষ।',
      },
      {
        'no': 4,
        'arabic': 'عَلَّمَهُ الْبَيَانَ ۝',
        'bangla_ucharon': 'আল্লামাহুল বায়ান।',
        'bangla_ortho': 'তিনি তাকে শিখিয়েছেন কথা বলতে (ভাব প্রকাশ করতে)।',
      },
      {
        'no': 5,
        'arabic': 'الشَّمْسُ وَالْقَمَرُ بِحُسْبَانٍ ۝',
        'bangla_ucharon': 'আশ-শামসু ওয়াল কামারু বিহুসবান।',
        'bangla_ortho': 'সূর্য ও চন্দ্র নির্ধারিত হিসাব অনুযায়ী চলে।',
      },
      {
        'no': 6,
        'arabic': 'وَالنَّجْمُ وَالشَّجَرُ يَسْجُدَانِ ۝',
        'bangla_ucharon': 'ওয়াননাজমু ওয়াশ শাজಾರು ইয়াসজুদান।',
        'bangla_ortho': 'তৃণলতা ও বৃক্ষরাজি তাকে সিজদা করছে।',
      },
      {
        'no': 7,
        'arabic': 'وَالسَّمَاءَ رَفَعَهَا وَوَضَعَ الْمِيزَانَ ۝',
        'bangla_ucharon': 'ওয়াস সামা-আ রাফাআহা ওয়া ওয়াদাআল মীযান।',
        'bangla_ortho':
            'তিনি আকাশকে করেছেন সমুন্নত এবং স্থাপন করেছেন ভারসাম্য।',
      },
      {
        'no': 8,
        'arabic': 'أَلَّا تَطْغَوْا فِي الْمِيزَانِ ۝',
        'bangla_ucharon': 'আল্লা তাতগাও ফিল মীযান।',
        'bangla_ortho': 'যাতে তোমরা ভারসাম্যে সীমালঙ্ঘন না করো।',
      },
      {
        'no': 9,
        'arabic':
            'وَأَقِيمُوا الْوزْنَ بِالْقِسْطِ وَلَا تُخْسِرُوا الْمِيزَانَ ۝',
        'bangla_ucharon':
            'ওয়া আকীমূল ওয়াযনা বিল কিসতি ওয়ালা তুখসিরুল মীযান।',
        'bangla_ortho': 'তোমরা ন্যায্য ওজন কায়েম করো এবং ওজনে কম দিও না।',
      },
      {
        'no': 10,
        'arabic': 'وَالْأَرْضَ وَضَعَهَا لِلْأَنَامِ ۝',
        'bangla_ucharon': 'ওয়াল আরদা ওয়াদাআহা লিল আনাম।',
        'bangla_ortho': 'তিনি পৃথিবীকে সৃষ্টি করেছেন জীবকুলের জন্য।',
      },
      {
        'no': 11,
        'arabic': 'فِيهَا فَاكِهَةٌ وَالنَّخْلُ ذَاتُ الْأَكْمَامِ ۝',
        'bangla_ucharon': 'ফীহা ফাকিহাতুন ওয়াননাখলু যাতুল আক মাম।',
        'bangla_ortho': 'এতে রয়েছে ফলমূল এবং আবরণযুক্ত খেজুর বৃক্ষ।',
      },
      {
        'no': 12,
        'arabic': 'وَالْحَبُّ ذُو الْعَصْفِ وَالرَّيْحَانُ ۝',
        'bangla_ucharon': 'ওয়াল হাব্বু যুল আসফি ওয়ার রায়হান।',
        'bangla_ortho': 'আরও আছে ভূষियুক্ত শস্য ও সুগন্ধি ফুল।',
      },
      {
        'no': 13,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে (জ্বিন ও মানব) তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 14,
        'arabic': 'خَلَقَ الْإِنْسَانَ مِنْ صَلْصَالٍ كَالْفَخَّارِ ۝',
        'bangla_ucharon': 'খালাকাল ইনসানা মিন সালসালিন কাল ফাখখার।',
        'bangla_ortho':
            'তিনি মানুষকে সৃষ্টি করেছেন পোড়া মাটির মতো শুষ্ক মাটি থেকে।',
      },
      {
        'no': 15,
        'arabic': 'وَخَلَقَ الْجَانَّ مِنْ مَارِجٍ مِنْ نَارٍ ۝',
        'bangla_ucharon': 'ওয়া খালাকাল জান্না মিম মারিজিম মিন নার।',
        'bangla_ortho': 'এবং তিনি জ্বিনকে সৃষ্টি করেছেন অগ্নিশিখা থেকে।',
      },
      {
        'no': 16,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 17,
        'arabic': 'رَبُّ الْمَشْرِقَيْنِ وَرَبُّ الْمَغْرِبَيْنِ ۝',
        'bangla_ucharon': 'রাব্বুল মাশরিক্বাইনি ওয়া রাব্বুল মাগরিবাইন।',
        'bangla_ortho': 'তিনি দুই উদয়াচল ও দুই অস্তাচলের মালিক।',
      },
      {
        'no': 18,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 19,
        'arabic': 'مَرَجَ الْبَحْرَيْنِ يَلْتَقِيَانِ ۝',
        'bangla_ucharon': 'মরাজাল বাহরাইনি ইয়ালতাক্বিয়ান।',
        'bangla_ortho':
            'তিনি দুই সমুদ্রকে প্রবাহিত করেন যারা একে অপরের সাথে মিলিত হয়,',
      },
      {
        'no': 20,
        'arabic': 'بَيْنَهُمَا بَرْزَخٌ لَا يَبْغِيَانِ ۝',
        'bangla_ucharon': 'বাইনামুহা বারঝাখুল লা ইয়াবগিয়ান।',
        'bangla_ortho':
            'উভয়ের মাঝখানে রয়েছে এক অন্তরাল, যা তারা অতিক্রম করতে পারে না।',
      },
      {
        'no': 21,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 22,
        'arabic': 'يَخْرُجُ مِنْهُمَا اللُّؤْلُؤُ وَالْمَرْجَانُ ۝',
        'bangla_ucharon': "ইয়াখরুজু মিনহুমাল লু'লুউ ওয়াল মারজান।",
        'bangla_ortho': 'উভয় সমুদ্র থেকে উৎপন্ন হয় মুক্তা ও প্রবাল।',
      },
      {
        'no': 23,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 24,
        'arabic':
            'وَلَهُ الْجَوَارِ الْمُنْشَآتُ فِي الْبَحْرِ كَالْأَعْلَامِ ۝',
        'bangla_ucharon': "ওয়া লাহুল জাওয়ারিল মুনশাআতু ফিল বাহরি কাল আ'লাম।",
        'bangla_ortho': 'সমুদ্রে বিচরণশীল পাহাড়তূল্য জাহাজগুলো তাঁরই।',
      },
      {
        'no': 25,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 26,
        'arabic': 'كُلُّ مَنْ عَلَيْهَا فَانٍ ۝',
        'bangla_ucharon': 'কুল্লু মান আলাইহা ফান।',
        'bangla_ortho': 'ভূপৃষ্ঠে যা কিছু আছে সব বিনাশশীল।',
      },
      {
        'no': 27,
        'arabic': 'وَيَبْقَىٰ وَجْهُ رَبِّكَ ذُو الْجَلَالِ وَالْإِكْرَامِ ۝',
        'bangla_ucharon':
            'ওয়া ইয়াবক্বা ওয়াজহু রাব্বিকা যুল জালালি ওয়াল ইকরাম।',
        'bangla_ortho':
            'কেবল টিকে থাকবে আপনার প্রতিপালকের মহিমাময় ও মহানুভব সত্তা।',
      },
      {
        'no': 28,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 29,
        'arabic':
            'يَسْأَلُهُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ ۝',
        'bangla_ucharon':
            'ইয়াসআলুহু মান ফিস সামাওয়াতি ওয়াল আরদি কুল্লা ইয়াওমিন হুয়া ফী শান।',
        'bangla_ortho':
            'নভোমন্ডল ও ভূমন্ডলের সবাই তাঁর কাছেই প্রার্থনা করে। প্রতি মুহূর্তে তিনি কোনো না কোনো কাজে রত।',
      },
      {
        'no': 30,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 31,
        'arabic': 'سَنَفْرُغُ لَكُمْ أَيُّهَ الثَّقَلَانِ ۝',
        'bangla_ucharon': 'সানাফরুগু লাকুম আইয়্যুহাস সাক্বালান।',
        'bangla_ortho':
            'হে দুই ভারী দল (মানব ও জ্বিন)! শীঘ্রই আমি তোমাদের (হিসাব গ্রহণের) জন্য অবসর গ্রহণ করব।',
      },
      {
        'no': 32,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 33,
        'arabic':
            'يَا مَعْشَرَ الْجِنِّ وَالْإِنْسِ إِنِ اسْتَطَعْتُمْ أَنْ تَنْفُذُوا مِنْ أَقْطَارِ السَّمَاوَاتِ وَالْأَرْضِ فَانْفُذُوا ۚ لَا تَنْفُذُونَ إِلَّا بِسُلْطَانٍ ۝',
        'bangla_ucharon':
            'ইয়া মা’শারাল জিন্নি ওয়াল ইনসি ইনিস তাতাতুম আন তানফুরূ মিন আক্বতারিস সামাওয়াতি ওয়াল আরদি ফানফুরূ, লা তানফুরূনা ইল্লা বিসুলতান।',
        'bangla_ortho':
            'হে জ্বিন ও মানব জাতি! আকাশমন্ডল ও পৃথিবীর সীমা অতিক্রম করার শক্তি থাকলে তোমরা করো; কিন্তু তোমরা তা পারবে না ক্ষমতা ছাড়া।',
      },
      {
        'no': 34,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 35,
        'arabic':
            'يُرْسَلُ عَلَيْكُمَا شُوَاظٌ مِنْ نَارٍ وَنُحَاسٌ فَلَا تَنْتَصِرَانِ ۝',
        'bangla_ucharon':
            'ইউরসালু আলাইকুমা শুয়াযুম মিন নারিন ওয়া নুহাসুন ফালা তানতাসিরান।',
        'bangla_ortho':
            'তোমাদের প্রতি অগ্নিশিখা ও ধোঁয়া ছাড়া হবে, যা তোমরা প্রতিহত করতে পারবে না।',
      },
      {
        'no': 36,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 37,
        'arabic':
            'فَإِذَا انْشَقَّتِ السَّمَاءُ فَكَانَتْ وَرْدَةً كَالدِّهَانِ ۝',
        'bangla_ucharon': 'ফাইযান শাক্কাতিস সামাউ ফাকানাত ওয়ারদাতান কাদ্দিহান।',
        'bangla_ortho': 'যখন আকাশ বিদীর্ণ হবে, তখন তা লাল চামড়ার মতো হয়ে যাবে।',
      },
      {
        'no': 38,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 39,
        'arabic':
            'فَيَوْمَئِذٍ لَا يُسْأَلُ عَنْ ذَنْبِهِ إِنْسٌ وَلَا جَانٌّ ۝',
        'bangla_ucharon': 'ফায়াওমায়িযিল লা ইউসআলু আন যানবিহী ইনসুওঁ ওয়ালা জান।',
        'bangla_ortho':
            'সেদিন কোনো মানুষ বা জ্বিনকে তার অপরাধ সম্পর্কে জিজ্ঞাসা করা হবে না।',
      },
      {
        'no': 40,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 41,
        'arabic':
            'يُعْرَفُ الْمُجْرِمُونَ بِسِيمَاهُمْ فَيُؤْخَذُ بِالنَّوَاصِي وَالْأَقْدَامِ ۝',
        'bangla_ucharon':
            'ইউ’রাফুল মুজরিমূনা বিসীমাহুম ফাউখাযু বিন্নওয়াসি ওয়াল আক্বদাম।',
        'bangla_ortho':
            'অপরাধীদের চেনা যাবে তাদের চেহারার লক্ষণ দেখে; তাদের ধরে টেনে নেওয়া হবে মাথার সামনের কেশগুচ্ছ ও পা ধরে।',
      },
      {
        'no': 42,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 43,
        'arabic': 'هَٰذِهِ جَهَنَّمُ الَّتِي يُكَذِّبُ بِهَا الْمُجْرِمُونَ ۝',
        'bangla_ucharon': 'হাযিহী জাহান্নামুল্লাতী ইউকাযযিবু বিহাল মুজরিমূন।',
        'bangla_ortho': 'এটাই সেই জাহান্নাম, যা অপরাধীরা অস্বীকার করত।',
      },
      {
        'no': 44,
        'arabic': 'يَطُوفُونَ بَيْنَهَا وَبَيْنَ حَمِيمٍ آنٍ ۝',
        'bangla_ucharon': 'ইয়াতূফূনা বাইনাহা ওয়া বাইনা হামীমিন আন।',
        'bangla_ortho':
            'তারা জাহান্নামের আগুন ও ফুটন্ত পানির মাঝখানে ঘোরাঘুরি করবে।',
      },
      {
        'no': 45,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 46,
        'arabic': 'وَلِمَنْ خَافَ مَقَامَ رَبِّهِ جَنَّتَانِ ۝',
        'bangla_ucharon': 'ওয়া লিমান খাফা মাক্বামা রাব্বিহী জান্নাতান।',
        'bangla_ortho':
            'যে ব্যক্তি তার প্রতিপালকের সামনে দাঁড়ানোকে ভয় করে, তার জন্য রয়েছে দুটি জান্নাত।',
      },
      {
        'no': 47,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 48,
        'arabic': 'ذَوَاتَا أَفْنَانٍ ۝',
        'bangla_ucharon': 'যাওয়াতা আফনান।',
        'bangla_ortho': 'উভয় জান্নাতই ঘন শাখা-পল্লববিশিষ্ট।',
      },
      {
        'no': 49,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 50,
        'arabic': 'فِيهِمَا عَيْنَانِ تَجْرِيَانِ ۝',
        'bangla_ucharon': 'ফীহিমা আইনানি তাজরিয়ান।',
        'bangla_ortho': 'উভয় জান্নাতে রয়েছে প্রবাহিত দুটি ঝর্ণাধারা।',
      },
      {
        'no': 51,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 52,
        'arabic': 'فِيهِمَا مِنْ كُلِّ فَاكِهَةٍ زَوْجَانِ ۝',
        'bangla_ucharon': 'ফীহিমা মিন কুল্লি ফাকিহাতিন যাওজান।',
        'bangla_ortho': 'উভয় জান্নাতে প্রত্যেক ফল রয়েছে দুই প্রকারের।',
      },
      {
        'no': 53,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 54,
        'arabic':
            'مُتَّكِئِينَ عَلَىٰ فُرُشٍ بَطَائِنُهَا مِنْ إِسْتَبْرَقٍ ۚ وَجَنَى الْجَنَّتَيْنِ دَانٍ ۝',
        'bangla_ucharon':
            'মুত্তাকিইনা আলা ফুরুশিম বাতায়িনুহা মিন ইস্তাবরাক্ব, ওয়া জানাল জান্নাতাইনি দান।',
        'bangla_ortho':
            'তারা এমন বিছানায় হেলান দিয়ে বসবে যার আস্তরণ হবে পুরু রেশমের এবং উভয় জান্নাতের ফল হবে নাগালের মধ্যে।',
      },
      {
        'no': 55,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 56,
        'arabic':
            'فِيهِنَّ قَاصِرَاتُ الطَّرْفِ لَمْ يَطْمِثْهُنَّ إِنْسٌ قَبْلَهُمْ وَلَا جَانٌّ ۝',
        'bangla_ucharon':
            'ফীহিন্না কাসিরাতুত ত্বরফি লাম ইয়াতমিসহুন্না ইনসুন কাবলাহুম ওয়ালা জান্ন।',
        'bangla_ortho':
            'সেখানে থাকবে আয়তলোচনা হুরগণ, যাদেরকে ইতিপূর্বে কোনো মানুষ বা জ্বিন স্পর্শ করেনি।',
      },
      {
        'no': 57,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 58,
        'arabic': 'كَأَنَّهُنَّ الْيَاقُوتُ وَالْمَرْجَانُ ۝',
        'bangla_ucharon': 'কাআন্নাহুন্নাল ইয়াক্বুতু ওয়াল মারজান।',
        'bangla_ortho': 'তারা দেখতে যেন ইয়াকুত ও প্রবাল।',
      },
      {
        'no': 59,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 60,
        'arabic': 'هَلْ جَزَاءُ الْإِحْسَانِ إِلَّا الْإِحْسَانُ ۝',
        'bangla_ucharon': 'হাল জাযাউল ইহসানি ইললাল ইহসান।',
        'bangla_ortho':
            'সদুপকার বা ইহসানের প্রতিদান কি ইহসান (উত্তম পুরস্কার) ছাড়া অন্য কিছু হতে পারে?',
      },
      {
        'no': 61,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 62,
        'arabic': 'وَمِنْ دُونِهِمَا جَنَّتَانِ ۝',
        'bangla_ucharon': 'ওয়া মিন দূনিহিমা জান্নাতান।',
        'bangla_ortho': 'এ দুটি ছাড়াও আরও দুটি জান্নাত রয়েছে।',
      },
      {
        'no': 63,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 64,
        'arabic': 'مُدْهَامَّتَانِ ۝',
        'bangla_ucharon': 'মুদহাম্মাতান।',
        'bangla_ortho': 'জান্নাত দুটি ঘন সবুজ শ্যামল।',
      },
      {
        'no': 65,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 66,
        'arabic': 'فِيهِمَا عَيْنَانِ نَضَّاخَتَانِ ۝',
        'bangla_ucharon': 'ফীহিমা আইনানি নাদ্দাক্বাতান।',
        'bangla_ortho': 'সেখানে আছে উচ্ছ্বসিত দুটি প্রস্রবণ।',
      },
      {
        'no': 67,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 68,
        'arabic': 'فِيهِمَا فَاكِهَةٌ وَنَخْلٌ وَرُمَّانٌ ۝',
        'bangla_ucharon': 'ফীহিমা ফাকিহাতুওঁ ওয়া নাখলুওঁ ওয়া রুম্মান।',
        'bangla_ortho': 'সেখানে আছে ফলমূল, খেজুর ও ডালিম।',
      },
      {
        'no': 69,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 70,
        'arabic': 'فِيهِنَّ خَيْرَاتٌ حِسَانٌ ۝',
        'bangla_ucharon': 'ফীহিন্না খাইরাতুন হিসান।',
        'bangla_ortho': 'সেখানে থাকবে উত্তম চরিত্রবতী সুন্দরী রমণীগণ।',
      },
      {
        'no': 71,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 72,
        'arabic': 'حُورٌ مَقْصُورَاتٌ فِي الْخِيَامِ ۝',
        'bangla_ucharon': 'হুরুম মাকসুরুতু ফিল খিয়াম।',
        'bangla_ortho': 'তাঁবুতে সুরক্ষিত থাকবে আয়তলোচনা হুরগণ।',
      },
      {
        'no': 73,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 74,
        'arabic': 'لَمْ يَطْمِثْهُنَّ إِنْسٌ قَبْلَهُمْ وَلَا جَانٌّ ۝',
        'bangla_ucharon': 'লাম ইয়াতমিসহুন্না ইনসুন কাবলাহুম ওয়ালা জান্ন।',
        'bangla_ortho': 'যাদেরকে ইতিপূর্বে কোনো মানুষ বা জ্বিন স্পর্শ করেনি।',
      },
      {
        'no': 75,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 76,
        'arabic': 'مُتَّكِئِينَ عَلَىٰ رَفْرَفٍ خُضْرٍ وَعَبْقَرِيٍّ حِسَانٍ ۝',
        'bangla_ucharon':
            'মুত্তাকিইনা আলা রাফরাফিন খুদরিন ওয়া আবক্বারিয়্যিন হিসান।',
        'bangla_ortho': 'তারা সবুজ বালিশে ও সুন্দর গালিচায় হেলান দিয়ে বসবে।',
      },
      {
        'no': 77,
        'arabic': 'فَبِأَيِّ آلَاءِ رَبِّكُمَا تُكَذِّبَانِ ۝',
        'bangla_ucharon': 'ফাবি আইয়ি আ-লাই রাব্বিকুমা তুকায়যিবান।',
        'bangla_ortho':
            'অতএব, তোমরা উভয়ে তোমাদের প্রতিপালকের কোন কোন নিয়ামতকে অস্বীকার করবে?',
      },
      {
        'no': 78,
        'arabic': 'تَبَارَكَ اسْمُ رَبِّكَ ذِي الْجَلَالِ وَالْإِكْرَامِ ۝',
        'bangla_ucharon': 'তাবারাকাসমু রাব্বিকা যিল জালালি ওয়াল ইকরাম।',
        'bangla_ortho':
            'কত পুণ্যময় আপনার প্রতিপালকের নাম, যিনি মহিমাময় ও মহানুভব।',
      },
    ],
  },

  //---------------সূরা আর রহমান----------------------
  {
    'sura_name': 'সূরা ত্বীন (৯৫)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'وَالتِّينِ وَالزَّيْتُونِ ۝',
        'bangla_ucharon': 'ওয়াত্তীনি ওয়াঝঝাইতূনি।',
        'bangla_ortho': 'শপথ ত্বীন (ডুমুর) ও যয়তূন ফলের।',
      },
      {
        'no': 2,
        'arabic': 'وَطُورِ سِينِينَ ۝',
        'bangla_ucharon': 'ওয়াতূরি সীনীনা।',
        'bangla_ortho': 'এবং সিনাই পর্বতের।',
      },
      {
        'no': 3,
        'arabic': 'وَهَٰذَا الْبَلَدِ الْأَمِينِ ۝',
        'bangla_ucharon': 'ওয়া হাজাল বালাদিল আমীন।',
        'bangla_ortho': 'এবং এই নিরাপদ নগরীর (মক্কা)।',
      },
      {
        'no': 4,
        'arabic': 'لَقَدْ خَلَقْنَا الْإِنْسَانَ فِي أَحْسَنِ تَقْوِيمٍ ۝',
        'bangla_ucharon': 'লাকাদ খালাকনাল ইনসানা ফী আহসানি তাক্বওয়ীম।',
        'bangla_ortho': 'আমি সৃষ্টি করেছি মানুষকে সুন্দরতম অবয়বে।',
      },
      {
        'no': 5,
        'arabic': 'ثُمَّ رَدَدْنَاهُ أَسْفَلَ سَافِلِينَ ۝',
        'bangla_ucharon': 'সুম্মা রাদাদনাহু আসফালা সাফিলীন।',
        'bangla_ortho': 'অতঃপর আমি তাকে ফিরিয়ে দিয়েছি নীচ থেকে নীচে।',
      },
      {
        'no': 6,
        'arabic':
            'إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَلَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ ۝',
        'bangla_ucharon':
            'ইল্লাল্লাযীনা আমানূ ওয়া আমিলুস সালিহাতি ফালাহুম আজরুন গাইরু মামনূন।',
        'bangla_ortho':
            'তবে যারা ঈমান এনেছে ও সৎকর্ম করেছে, তাদের জন্য রয়েছে অফুরন্ত পুরস্কার।',
      },
      {
        'no': 7,
        'arabic': 'فَمَا يُكَذِّبُكَ بَعْدُ بِالدِّينِ ۝',
        'bangla_ucharon': 'ফামা ইউকাযযিবুকা বা’দু বিদ্দীন।',
        'bangla_ortho':
            'কাজেই এরপর কিসে তোমাকে বিচার দিবস সম্পর্কে অবিশ্বাসী করে?',
      },
      {
        'no': 8,
        'arabic': 'أَلَيْسَ اللَّهُ بِأَحْكَمِ الْحَاكِمِينَ ۝',
        'bangla_ucharon': 'আলাইসাল্লাহু বিআহকামিল হাকিমীন।',
        'bangla_ortho': 'আল্লাহ কি বিচারকদের শ্রেষ্ঠ বিচারক নন?',
      },
    ],
  },
  {
    'sura_name': 'সূরা ক্বদর (৯৭)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ ۝',
        'bangla_ucharon': 'ইন্না আনঝালনাহু ফী লাইলাতিল কাদর।',
        'bangla_ortho': 'নিশ্চয়ই আমি এটি (কুরআন) নাযিল করেছি কদরের রাতে।',
      },
      {
        'no': 2,
        'arabic': 'وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ ۝',
        'bangla_ucharon': 'ওয়ামা আদরাকা মা লাইলাতুল কাদর।',
        'bangla_ortho': 'আর কদরের রাত সম্বন্ধে আপনি কি জানেন?',
      },
      {
        'no': 3,
        'arabic': 'لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ ۝',
        'bangla_ucharon': 'লাইলাতুল কাদরি খাইরুম মিন আলফি শাহর।',
        'bangla_ortho': 'কদরের রাত হাজার মাসের চেয়েও শ্রেষ্ঠ।',
      },
      {
        'no': 4,
        'arabic':
            'تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِمْ مِنْ كُلِّ أَمْرٍ ۝',
        'bangla_ucharon':
            'তানাজ্জালুল মালাইকাতু ওয়াররূহু ফীহা বিইজনি রাব্বিহিম মিন কুল্লি আমর।',
        'bangla_ortho':
            'সে রাতে ফেরেশতাগণ ও রূহ (জিবরাঈল) অবতীর্ণ হন তাদের পালনকর্তার অনুমতিক্রমে প্রতিটি কাজের জন্য।',
      },
      {
        'no': 5,
        'arabic': 'سَلَامٌ هِيَ حَتَّىٰ مَطْلَعِ الْفَجْرِ ۝',
        'bangla_ucharon': 'সালামুন হিয়া হাত্তা মাতলাইল ফজর।',
        'bangla_ortho': 'শান্তিময় সেই রাত ফজরের উদয় হওয়া পর্যন্ত।',
      },
    ],
  },
  {
    'sura_name': 'সূরা তাকাছুর (১০২)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'أَلْهَاكُمُ التَّكَاثُرُ ۝',
        'bangla_ucharon': 'আলহাকুমুত তাকাসুর।',
        'bangla_ortho':
            'প্রাচুর্যের প্রতিযোগিতা তোমাদেরকে মোহাবিষ্ট করে রেখেছে।',
      },
      {
        'no': 2,
        'arabic': 'حَتَّىٰ زُرْتُمُ الْمَقَابِرَ ۝',
        'bangla_ucharon': 'হাত্তা জুরতুমুল মাকাবির।',
        'bangla_ortho': 'যতক্ষণ না তোমরা কবরে পৌঁছাও।',
      },
      {
        'no': 3,
        'arabic': 'كَلَّا سَوْفَ تَعْلَمُونَ ۝',
        'bangla_ucharon': 'কাল্লা সাওফা তা’লামুন।',
        'bangla_ortho': 'কখনোই নয়, তোমরা শীঘ্রই জানতে পারবে।',
      },
      {
        'no': 4,
        'arabic': 'ثُمَّ كَلَّا سَوْفَ تَعْلَمُونَ ۝',
        'bangla_ucharon': 'সুম্মা কাল্লা সাওফা তা’লামুন।',
        'bangla_ortho': 'আবারও বলি, কখনোই নয়, শীঘ্রই তোমরা জানতে পারবে।',
      },
      {
        'no': 5,
        'arabic': 'كَلَّا لَوْ تَعْلَمُونَ عِلْمَ الْيَقِينِ ۝',
        'bangla_ucharon': 'কাল্লা লাও তা’লামুনা ইলমাল ইয়াক্বীন।',
        'bangla_ortho':
            'কখনোই নয়, যদি তোমরা নিশ্চিত জ্ঞানে জানতে (তবে মোহাবিষ্ট হতে না)।',
      },
      {
        'no': 6,
        'arabic': 'لَتَرَوُنَّ الْجَحِيمَ ۝',
        'bangla_ucharon': 'লাতারায়ুন্নাল জাহীম।',
        'bangla_ortho': 'তোমরা অবশ্যই জাহান্নাম দেখবে।',
      },
      {
        'no': 7,
        'arabic': 'ثُمَّ لَتَرَوُنَّهَا عَيْنَ الْيَقِينِ ۝',
        'bangla_ucharon': 'সুম্মা লাতারায়ুন্নাহা আইনাল ইয়াক্বীন।',
        'bangla_ortho': 'অতঃপর তোমরা তা অবশ্যই চাক্ষুষ প্রত্যয়ে দেখবে।',
      },
      {
        'no': 8,
        'arabic': 'ثُمَّ لَتُسْأَلُنَّ يَوْمَئِذٍ عَنِ النَّعِيمِ ۝',
        'bangla_ucharon': 'সুম্মা লাতুসআলুন্না ইয়াওমায়িযিন আনিন নাঈম।',
        'bangla_ortho':
            'অতঃপর সেদিন অবশ্যই তোমরা নেয়ামতসমূহ সম্পর্কে জিজ্ঞাসিত হবে।',
      },
    ],
  },
  {
    'sura_name': 'সূরা আছর (১০৩)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'وَالْعَصْرِ ۝',
        'bangla_ucharon': 'ওয়াল ‘আসর।',
        'bangla_ortho': 'সময়ের শপথ,',
      },
      {
        'no': 2,
        'arabic': 'إِنَّ الْإِنْسَانَ لَفِي خُسْرٍ ۝',
        'bangla_ucharon': 'ইন্নাল ইনসানা লাফী খুসর।',
        'bangla_ortho': 'নিশ্চয়ই মানুষ অত্যন্ত ক্ষতিগ্রস্ততায় রয়েছে,',
      },
      {
        'no': 3,
        'arabic':
            'إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ ۝',
        'bangla_ucharon':
            'ইল্লাল্লাযীনা আমানূ ওয়া ‘আমিলুস সালিহাতি ওয়া তাওয়া ছাও বিল হাক্বি ওয়া তাওয়া ছাও বিস সাবর।',
        'bangla_ortho':
            'তবে তারা ছাড়া—যারা ঈমান এনেছে, সৎকর্ম করেছে এবং পরস্পরকে সত্যের উপদেশ দিয়েছে ও ধৈর্যের উপদেশ দিয়েছে।',
      },
    ],
  },
  {
    'sura_name': 'সূরা ফীল (১০৫)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ ۝',
        'bangla_ucharon': 'আলাম তারা কাইফা ফা‘আলা রাব্বুকা বিআসহাবিল ফীল।',
        'bangla_ortho':
            'তুমি কি দেখনি তোমার প্রতিপালক হাতিওয়ালাদের সঙ্গে কী করেছিলেন?',
      },
      {
        'no': 2,
        'arabic': 'أَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ ۝',
        'bangla_ucharon': 'আলাম ইয়াজ‘আল কাইদাহুম ফি তাদলীল।',
        'bangla_ortho': 'তিনি কি তাদের কৌশল ব্যর্থ করে দেননি?',
      },
      {
        'no': 3,
        'arabic': 'وَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ ۝',
        'bangla_ucharon': 'ওয়া আরসালা আলাইহিম ত্বাইরান আবাবীল।',
        'bangla_ortho': 'আর তিনি তাদের ওপর ঝাঁকে ঝাঁকে পাখি পাঠিয়েছিলেন।',
      },
      {
        'no': 4,
        'arabic': 'تَرْمِيهِمْ بِحِجَارَةٍ مِنْ سِجِّيلٍ ۝',
        'bangla_ucharon': 'তারমীহিম বিহিজারাতিম মিন সিজ্জীল।',
        'bangla_ortho': 'যারা তাদের ওপর নিক্ষেপ করেছিল পোড়া মাটির পাথর।',
      },
      {
        'no': 5,
        'arabic': 'فَجَعَلَهُمْ كَعَصْفٍ مَأْكُولٍ ۝',
        'bangla_ucharon': 'ফাজা‘আলাহুম কা‘আসফিম মাকূল।',
        'bangla_ortho': 'ফলে তিনি তাদেরকে ভক্ষিত তৃণের ন্যায় করে দিয়েছিলেন।',
      },
    ],
  },
  {
    'sura_name': 'সূরা কুরাইশ (১০৬)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'لِإِيلَافِ قُرَيْشٍ ۝',
        'bangla_ucharon': 'লি-ঈলাফি কুরাইশ।',
        'bangla_ortho': 'কুরাইশের আসক্তির কারণে—',
      },
      {
        'no': 2,
        'arabic': 'إِيلَافِهِمْ رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ ۝',
        'bangla_ucharon': 'ঈলাফিহিম রিহলাতাশ শিতাই ওয়াস সাইফ।',
        'bangla_ortho': 'শীত ও গ্রীষ্মকালের সফরের আসক্তির কারণে—',
      },
      {
        'no': 3,
        'arabic': 'فَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ ۝',
        'bangla_ucharon': 'ফালইয়া‘বুদূ রাব্বা হাজাল বাইত।',
        'bangla_ortho': 'অতএব তারা যেন এই ঘরের রবের ইবাদত করে—',
      },
      {
        'no': 4,
        'arabic': 'الَّذِي أَطْعَمَهُمْ مِنْ جُوعٍ وَآمَنَهُمْ مِنْ خَوْفٍ ۝',
        'bangla_ucharon': 'আল্লাজি আত‘আমাহুম মিন জূ‘ইন ওয়া আমানাহুম মিন খাওফ।',
        'bangla_ortho':
            'যিনি তাদেরকে ক্ষুধা থেকে আহার দিয়েছেন এবং ভয় থেকে নিরাপদ করেছেন।',
      },
    ],
  },
  {
    'sura_name': 'সূরা মাউন (১০৭)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'أَرَأَيْتَ الَّذِي يُكَذِّبُ بِالدِّينِ ۝',
        'bangla_ucharon': 'আরাআইতাল্লাযী ইউকাযযিবু বিদ্দীন।',
        'bangla_ortho': 'আপনি কি তাকে দেখেছেন, যে বিচার দিবসকে অস্বীকার করে?',
      },
      {
        'no': 2,
        'arabic': 'فَذَٰلِكَ الَّذِي يَدُعُّ الْيَتِيمَ ۝',
        'bangla_ucharon': 'ফাযালিকাল্লাযী ইয়াদুউ’ল ইয়াতীম।',
        'bangla_ortho': 'সে তো ওই ব্যক্তি, যে এতিমকে রূঢ়ভাবে তাড়িয়ে দেয়,',
      },
      {
        'no': 3,
        'arabic': 'وَلَا يَحُضُّ عَلَىٰ طَعَامِ الْمِسْكِينِ ۝',
        'bangla_ucharon': 'ওয়ালা ইয়াহুদ্দু আলা তায়ামিল মিসকীন।',
        'bangla_ortho': 'এবং সে অভাবগ্রস্তকে খাদ্য দানে উৎসাহিত করে না।',
      },
      {
        'no': 4,
        'arabic': 'فَوَيْلٌ لِلْمُصَلِّينَ ۝',
        'bangla_ucharon': 'ফাওয়াইলুল লিলমুসাল্লীন।',
        'bangla_ortho': 'অতএব দুর্ভোগ সেই সব মুসল্লীদের জন্য,',
      },
      {
        'no': 5,
        'arabic': 'الَّذِينَ هُمْ عَنْ صَلَاتِهِمْ سَاهُونَ ۝',
        'bangla_ucharon': 'আল্লাযীনা হুম আন সালাতিহিম সাহূন।',
        'bangla_ortho': 'যারা তাদের নামাজে অমনোযোগী (উদাসীন),',
      },
      {
        'no': 6,
        'arabic': 'الَّذِينَ هُمْ يُرَاءُونَ ۝',
        'bangla_ucharon': 'আল্লাযীনা হুম ইউরাঊন।',
        'bangla_ortho': 'যারা লোক দেখানোর জন্য তা করে,',
      },
      {
        'no': 7,
        'arabic': 'وَيَمْنَعُونَ الْمَاعُونَ ۝',
        'bangla_ucharon': 'ওয়া ইয়ামনাঊনাল মাঊন।',
        'bangla_ortho':
            'এবং যারা নিত্যপ্রয়োজনীয় ছোটখাটো সাহায্য দানে বিরত থাকে।',
      },
    ],
  },
  {
    'sura_name': 'সূরা কাওসার (১০৮)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ ۝',
        'bangla_ucharon': 'ইন্না আ’তাইনিকাল কাওসার।',
        'bangla_ortho': 'নিশ্চয়ই আমি আপনাকে কাওসার (অফুরন্ত কল্যাণ) দান করেছি।',
      },
      {
        'no': 2,
        'arabic': 'فَصَلِّ لِرَبِّكَ وَانْحَرْ ۝',
        'bangla_ucharon': 'ফাসাল্লি লিরাব্বিকা ওয়ানহার।',
        'bangla_ortho':
            'অতএব আপনার রবের উদ্দেশ্যেই নামাজ পড়ুন এবং কোরবানি করুন।',
      },
      {
        'no': 3,
        'arabic': 'إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ ۝',
        'bangla_ucharon': 'ইন্না শানিয়াকা হুয়াল আবতার।',
        'bangla_ortho': 'নিশ্চয়ই আপনার প্রতি বিদ্বেষ পোষণকারীই নির্বংশ।',
      },
    ],
  },
  {
    'sura_name': 'সূরা কাফিরুন (১০৯)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'قُلْ يَا أَيُّهَا الْكَافِرُونَ ۝',
        'bangla_ucharon': 'কুল ইয়া আইয়্যুহাল কাফিরূন।',
        'bangla_ortho': 'বলুন, হে কাফির সম্প্রদায়!',
      },
      {
        'no': 2,
        'arabic': 'لَا أَعْبُدُ مَا تَعْبُدُونَ ۝',
        'bangla_ucharon': 'লা আ’বুদু মা তা’বুদূন।',
        'bangla_ortho': 'আমি তার ইবাদত করি না, যার ইবাদত তোমরা কর।',
      },
      {
        'no': 3,
        'arabic': 'وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ ۝',
        'bangla_ucharon': 'ওয়ালা আনতুম আবিদূনা মা আ’বুদ।',
        'bangla_ortho': 'এবং তোমরাও তাঁর ইবাদতকারী নও, যাঁর ইবাদত আমি করি।',
      },
      {
        'no': 4,
        'arabic': 'وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ ۝',
        'bangla_ucharon': 'ওয়ালা আনা আবিদুম মা আবাদতুম।',
        'bangla_ortho': 'আর আমি ইবাদতকারী নই তার, যার ইবাদত তোমরা করে আসছ।',
      },
      {
        'no': 5,
        'arabic': 'وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ ۝',
        'bangla_ucharon': 'ওয়ালা আনতুম আবিদূনা মা আ’বুদ।',
        'bangla_ortho': 'এবং তোমরা তাঁর ইবাদতকারী নও, যাঁর ইবাদত আমি করি।',
      },
      {
        'no': 6,
        'arabic': 'لَكُمْ دِينُكُمْ وَلِيَ دِينِ ۝',
        'bangla_ucharon': 'লাকুম দীনুকুম ওয়ালিয়া দীন।',
        'bangla_ortho': 'তোমাদের জন্য তোমাদের ধর্ম এবং আমার জন্য আমার ধর্ম।',
      },
    ],
  },
  {
    'sura_name': 'সূরা নাসর (১১০)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ ۝',
        'bangla_ucharon': 'ইযা জাআ নাসরুল্লাহি ওয়াল ফাতহ্।',
        'bangla_ortho': 'যখন আসবে আল্লাহর সাহায্য ও বিজয়,',
      },
      {
        'no': 2,
        'arabic':
            'وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا ۝',
        'bangla_ucharon':
            'ওয়ারা আইতান্নাসা ইয়াদখুলূনা ফী দ্বীনিল্লাহি আফওয়াজা।',
        'bangla_ortho':
            'এবং আপনি মানুষকে দলে দলে আল্লাহর দ্বীনে প্রবেশ করতে দেখবেন,',
      },
      {
        'no': 3,
        'arabic':
            'فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ ۚ إِنَّهُ كَانَ تَوَّابًا ۝',
        'bangla_ucharon':
            'ফাসাব্বিহ বিহামদি রাব্বিকা ওয়াসতাগফিরহু, ইন্নাহু কানা তাওয়্যাবা।',
        'bangla_ortho':
            'তখন আপনি আপনার রবের সপ্রশংস পবিত্রতা ঘোষণা করুন এবং তাঁর কাছে ক্ষমা প্রার্থনা করুন; নিশ্চয়ই তিনি ক্ষমা কবুলকারী।',
      },
    ],
  },
  {
    'sura_name': 'সূরা লাহাব (১১১)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ ۝',
        'bangla_ucharon': 'তাব্বাত ইয়াদা আবী লাহাবিওঁ ওয়াতাব্ব।',
        'bangla_ortho':
            'আবু লাহাবের হাত দুটি ধ্বংস হোক এবং সে নিজেও ধ্বংস হোক।',
      },
      {
        'no': 2,
        'arabic': 'مَا أَغْنَىٰ عَنْهُ مَالُهُ وَمَا كَسَبَ ۝',
        'bangla_ucharon': 'মা আগনা আনহু মালুহু ওয়ামা কাসাব।',
        'bangla_ortho':
            'তার ধন-সম্পদ ও যা সে অর্জন করেছে তা তার কোনো কাজে আসেনি।',
      },
      {
        'no': 3,
        'arabic': 'سَيَصْلَىٰ نَارًا ذَاتَ لَهَبٍ ۝',
        'bangla_ucharon': 'সাইয়াসলা নারান জাতা লাহাব।',
        'bangla_ortho': 'শীঘ্রই সে দহন শিখাযুক্ত অগ্নিতে প্রবেশ করবে,',
      },
      {
        'no': 4,
        'arabic': 'وَامْرَأَتُهُ حَمَّالَةَ الْحَطَبِ ۝',
        'bangla_ucharon': 'ওয়ামরাআতুহু হাম্মালাতাল হাত্বাব।',
        'bangla_ortho': 'এবং তার স্ত্রীও—যে ইন্ধন (খড়ি) বহনকারী,',
      },
      {
        'no': 5,
        'arabic': 'فِي جِيدِهَا حَبْلٌ مِنْ مَسَدٍ ۝',
        'bangla_ucharon': 'ফী জীদিহা হাবলুম মিম মাসাদ।',
        'bangla_ortho': 'তার গলায় পাকানো রশি নিয়ে।',
      },
    ],
  },
  {
    'sura_name': 'সূরা ইখলাস (১১২)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'قُلْ هُوَ اللَّهُ أَحَدٌ ۝',
        'bangla_ucharon': 'কুল হুওয়াল্লাহু আহাদ।',
        'bangla_ortho': 'বলুন, তিনিই আল্লাহ, একক-অদ্বিতীয়।',
      },
      {
        'no': 2,
        'arabic': 'اللَّهُ الصَّمَدُ ۝',
        'bangla_ucharon': 'আল্লাহুচ্ছামাদ।',
        'bangla_ortho': 'আল্লাহ কারো মুখাপেক্ষী নন, সকলেই তাঁর মুখাপেক্ষী।',
      },
      {
        'no': 3,
        'arabic': 'لَمْ يَلِدْ وَلَمْ يُولَدْ ۝',
        'bangla_ucharon': 'লাম ইয়ালিদ ওয়া লাম ইউলাদ।',
        'bangla_ortho': 'তিনি কাউকে জন্ম দেননি এবং তাঁকেও জন্ম দেয়া হয়নি।',
      },
      {
        'no': 4,
        'arabic': 'وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ ۝',
        'bangla_ucharon': 'ওয়া লাম ইয়াকুল্লাহু কুফুওয়ান আহাদ।',
        'bangla_ortho': 'এবং তাঁর সমতুল্য কেউই নেই।',
      },
    ],
  },
  {
    'sura_name': 'সূরা ফালাক (১১৩)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ۝',
        'bangla_ucharon': 'কুল আউযু বিরাব্বিল ফালাক্ব।',
        'bangla_ortho': 'বলুন, আমি আশ্রয় প্রার্থনা করছি ঊষার অধিপতির,',
      },
      {
        'no': 2,
        'arabic': 'مِن شَرِّ مَا خَلَقَ ۝',
        'bangla_ucharon': 'মিন শাররি মা খালাক্ব।',
        'bangla_ortho': 'তিনি যা সৃষ্টি করেছেন তার অনিষ্ট হতে,',
      },
      {
        'no': 3,
        'arabic': 'وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝',
        'bangla_ucharon': 'ওয়া মিন শাররি গাসিক্বিন ইযা ওয়াক্বাব।',
        'bangla_ortho': 'এবং অন্ধকার রাত্রির অনিষ্ট হতে, যখন তা সমাগত হয়,',
      },
      {
        'no': 4,
        'arabic': 'وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ۝',
        'bangla_ucharon': 'ওয়া মিন শাররিন নাফফাসাতি ফিল উক্বদ।',
        'bangla_ortho':
            'এবং গ্রন্থিতে ফুঁৎকারদানকারী (জাদুকর) নারীদের অনিষ্ট হতে,',
      },
      {
        'no': 5,
        'arabic': 'وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ۝',
        'bangla_ucharon': 'ওয়া মিন শাররি হাসিদিন ইযা হাসাদ।',
        'bangla_ortho': 'এবং হিংসুকের অনিষ্ট হতে, যখন সে হিংসা করে।',
      },
    ],
  },
  {
    'sura_name': 'সূরা নাস (১১৪)',
    'ayat': [
      {
        'no': 1,
        'arabic': 'قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۝',
        'bangla_ucharon': 'কুল আউযু বিরাব্বিন নাস।',
        'bangla_ortho': 'বলুন, আমি আশ্রয় প্রার্থনা করছি মানুষের অধিপতির,',
      },
      {
        'no': 2,
        'arabic': 'مَلِكِ النَّاسِ ۝',
        'bangla_ucharon': 'মালিকিন নাস।',
        'bangla_ortho': 'মানুষের অধিপতির (রাজার),',
      },
      {
        'no': 3,
        'arabic': 'إِلَٰهِ النَّاسِ ۝',
        'bangla_ucharon': 'ইলাহিন নাস।',
        'bangla_ortho': 'মানুষের মাবুদের (উপাস্য),',
      },
      {
        'no': 4,
        'arabic': 'مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ۝',
        'bangla_ucharon': 'মিন শাররিল ওয়াসওয়াসিল খান্নাস।',
        'bangla_ortho': 'পলায়নপর কুমন্ত্রণাদাতার অনিষ্ট হতে,',
      },
      {
        'no': 5,
        'arabic': 'الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۝',
        'bangla_ucharon': 'আল্লাযী ইউওয়াসউইসু ফী সুদূরিন নাস।',
        'bangla_ortho': 'যে মানুষের অন্তরে কুমন্ত্রণা দেয়,',
      },
      {
        'no': 6,
        'arabic': 'مِنَ الْجِنَّةِ وَالنَّاسِ ۝',
        'bangla_ucharon': 'মিনাল জিন্নাতি ওয়ান নাস।',
        'bangla_ortho': 'জ্বিন ও মানুষের মধ্য হতে।',
      },
    ],
  },
];
